DataProcessors/ВакцинацииКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ВакцинацииКлиентов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ВакцинацияПациентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВакцинацияПациентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыполненаВСтороннейОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполнившийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазначившийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодтвердившийПользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодтвержденаВрачом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛистОжидания</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛистОжидания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вакцинация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вакцинации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛистОжидания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЛистОжидания</Name>
			<BasedOn>
				<xr:Item>Document.Заявка</xr:Item>
				<xr:Item>Document.Прием</xr:Item>
				<xr:Item>Document.Событие</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументВыполнения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЛистаОжидания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеСодержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныЗаписиНаПрием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoogleIDСобытия</Name>
					<Comment>Используется 33 символа, непонятно, как будет потом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoogleКалендарьИмпорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРекламы</Name>
					<Comment>UTM_MEDIUM</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыРекламы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Comment>UTM_SOURCE</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламнаяКомпания</Name>
					<Comment>UTM_CAMPAIGN</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючевоеСловоРекламнойКомпании</Name>
					<Comment>UTM_TERM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеОбъявления</Name>
					<Comment>UTM_CONTENT</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЖелаемоеВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Окончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененияПериода</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Вакцинации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Вакцинации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Осложнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плановая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДнейДоОкончанияЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейДоСтартаЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцевДоОкончанияЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцевДоСтартаЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Осложнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначаетсяВручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗаписиВЛистОжидания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗаписиНаПрием</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураВакцинации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (материал или услуга)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ВакцинацииКлиентов/Forms/Форма/Ext/Form/Module.bsl
// Для унивикации условных запросов в таблице вакцинаций реквизита формы используется поле "Состояние",
// вычисляемое исходя из других данных списка. На форму данное поле не выводится.

#Область РазделОписанияПеременных

// При автоподборе и окончании ввода текста указывает, следует ли искать введенное значение в кодах справочника.
&НаКлиенте
Перем мИспользоватьАвтоПодборКлиентовПоКоду;

&НаКлиенте
Перем мКлиентКэш;

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ОтображениеОтмененных	 = РаботаСФормамиСервер.ПолучитьНастройкуФормы("ФормаСпискаНоменклатуры",	"ОтображениеОтмененных",	"Отображать");
	ОтображениеЗавершенных	 = РаботаСФормамиСервер.ПолучитьНастройкуФормы("ФормаСпискаНоменклатуры",	"ОтображениеЗавершенных",	"Отображать");
	
	// Определим ограничены ли права пользователя функционалом медсестры.
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	ФункционалМедсестры = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь, "ОграничитьВакцинациюПравамиМедсестры");
	
	// Установим недоступность некоторых команд для медсестер.
	Если ФункционалМедсестры Тогда
		Элементы.НазначенныеВакцинацииГруппаКнопокВрача.Доступность = Ложь;
		Элементы.НазначенныеВакцинацииКонтекстноеМенюГруппа1.Доступность = Ложь;
	КонецЕсли;
	
	// Установим видимость команды "Открыть регистр"
	Если Не ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.ВакцинацияПациентов) Тогда
		Элементы.ОткрытьРегистр.Видимость = Ложь;
	КонецЕсли;
	
	Если Не УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ИспользоватьЛистыОжиданияЗаписи")
		Или Не УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВакцинацииСоздаютЛистыОжидания")
	Тогда
		Элементы.НазначенныеВакцинацииЛистОжидания.Видимость = Ложь;
	КонецЕсли;
	
	// Заполним данные
	Если Параметры.Свойство("Клиент") Тогда
		Клиент = Параметры.Клиент;
	КонецЕсли;

	ОбновитьДанныеКлиента();
	ЗагрузитьВакцинацииКлиента();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мКлиентКэш = Клиент;
	мИспользоватьАвтоПодборКлиентовПоКоду = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ИспользоватьАвтоПодборКлиентовПоКоду");
	СоздаватьПриёмПриОтметкеВыполненияОбновлениеСостояния(Истина);
	
	ОбновитьОтображениеОтмененныхЗавершенных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиФормы = Новый Структура;
	НастройкиФормы.Вставить("ОтображениеОтмененных", ОтображениеОтмененных);
	НастройкиФормы.Вставить("ОтображениеЗавершенных", ОтображениеЗавершенных);
	
	РаботаСФормамиСервер.СохранитьНастройкиФормы(НастройкиФормы, "ФормаСпискаНоменклатуры"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Клиенты") И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Клиент = ВыбранноеЗначение;
		КлиентПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "УдалениеСтрокВакцинаций" Тогда
		ЗагрузитьВакцинацииКлиента();
		ОбновитьОтображениеОтмененныхЗавершенных();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПлановые(Команда)
	
	Если СообщитьКлиентНеЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаРождения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбран клиент или не заполнена его дата рождения'"));
		Возврат;
	КонецЕсли;
	
	НазначенныеВакцинацииКопия = НазначенныеВакцинации;
	ИнформацияОДобавляемых = ЗаполнитьПлановыеНаСервере(НазначенныеВакцинацииКопия);
	Если ИнформацияОДобавляемых.ВакцинацииДляДобавления.Количество() <> 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьПлановыеПослеВыбораНужных", ЭтотОбъект, ИнформацияОДобавляемых);
		РаботаСФормамиКлиент.ВводЗначенийСпискомСФлажкамиИзСпискаЗначений(ИнформацияОДобавляемых.ВакцинацииДляДобавления, Оповещение);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Нет новых плановых вакцинаций для добавления.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВакцинацию(Команда)
	
	Если СообщитьКлиентНеЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ДобавитьВакцинациюПослеВыбора", ЭтотОбъект);
	ОткрытьФорму("Справочник.Вакцинации.ФормаВыбора", , , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Перечитать(Команда)
	ЗагрузитьВакцинацииКлиента();
	ОбновитьОтображениеОтмененныхЗавершенных();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМедотвод(Команда)
	
	Если СообщитьКлиентНеЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.НазначенныеВакцинации.ТекущиеДанные;
	
	// При пустой таблице и для строк уровня вакцинации команда не работает.
	Если НазначенныеВакцинации.ПолучитьЭлементы().Количество() = 0
		Или ТекущиеДанные = Неопределено
		Или ТекущиеДанные.ПолучитьРодителя() = Неопределено
	Тогда
		Возврат;
	КонецЕсли;
	
	// Если состояние этапа отменен или выполнен, то команда тоже не работает.
	Если ТекущиеДанные.Состояние = "Отменена"
		Или ТекущиеДанные.Состояние = "Выполнена"	
	Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.НазначенныеВакцинации.ТекущаяСтрока;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИмяЭлемента", "Медотвод");
	ПараметрыОткрытия.Вставить("НомерСтроки", ТекущаяСтрока);
	ПараметрыОткрытия.Вставить("ПараметрЗаголовокФормы", НСтр("ru='На сколько сдвинуть'"));
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьМедотводПослеВводаСрока", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВводВозраста", ПараметрыОткрытия, , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыполнениеПодтвержденных(Команда)
	
	Если СообщитьКлиентНеЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	// При пустой таблице команда не работает
	Если НазначенныеВакцинации.ПолучитьЭлементы().Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Нет подтвержденных вакцинаций'"));
		Возврат;
	КонецЕсли;
	
	// Проверка заполненности номенклатуры в вакцинациях с прописанной номенклатурой
	ПереченьНезаполненных = "";
	Для Каждого СтрокаВакцинации Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаЭтапа Из СтрокаВакцинации.ПолучитьЭлементы() Цикл
			
			Если СтрокаЭтапа.ПодтвержденаВрачом
				И Не ЗначениеЗаполнено(СтрокаЭтапа.ФактическаяДата)
				И СтрокаЭтапа.ЕстьНоменклатура
				И Не ЗначениеЗаполнено(СтрокаЭтапа.Номенклатура)
			Тогда
				Описание = Символы.Таб + Строка(СтрокаВакцинации.Вакцинация) +  " - " + НСтр("ru='этап'") + ": " + СтрокаЭтапа.Этап;
				ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ПереченьНезаполненных, Описание, Символы.ПС);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	Если ЗначениеЗаполнено(ПереченьНезаполненных) Тогда
		ТекстПредупреждения = НСтр("ru='Не указана номенклатура услуги для:'") + Символы.ПС + ПереченьНезаполненных;
		ПоказатьПредупреждение(,ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	
	// Отметка выполнения подтвержденных вакцинация
	ЕстьПодтвержденные = Ложь;
	Для Каждого СтрокаВакцинации Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаЭтапа Из СтрокаВакцинации.ПолучитьЭлементы() Цикл
			
			Если СтрокаЭтапа.ПодтвержденаВрачом И Не ЗначениеЗаполнено(СтрокаЭтапа.ФактическаяДата) Тогда
				ЕстьПодтвержденные = Истина;
				СтрокаЭтапа.ФактическаяДата = ТекущаяДата();
				СтрокаЭтапа.Отменена = Ложь;
				СтрокаЭтапа.ВыполнившийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	Если Не ЕстьПодтвержденные Тогда 
		ПоказатьПредупреждение(, НСтр("ru='Нет подтвержденных вакцинаций'"));
		Возврат;
	КонецЕсли;		
	
	СохранитьИзмененияВакцинацийВФорме(Истина);
	
	Если СоздаватьПриёмПриОтметкеВыполнения Тогда
		СоздатьПриём(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыполнениеВДругойОрганизации(Команда)
	
	ОтметитьВыполнениеВПрошлом();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыполнениеВПрошломУНас(Команда)
	
	ОтметитьВыполнениеВПрошлом(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкуВыполненияУдалить(Команда)
	
	Если СообщитьКлиентНеЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаНазначения = Элементы.НазначенныеВакцинации.ТекущиеДанные;
	Если СтрокаНазначения <> Неопределено
		И СтрокаНазначения.ПолучитьРодителя() <> Неопределено
		И ЗначениеЗаполнено(СтрокаНазначения.ФактическаяДата)
	Тогда
		СтрокаНазначения.ФактическаяДата = Дата(1,1,1);
		СтрокаНазначения.ВыполненаВСтороннейОрганизации = Ложь;
		
		СохранитьИзмененияВакцинацийВФорме();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриём(Команда)
	
	Если СообщитьКлиентНеЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	Работы = Новый Массив;
	ШаблоныПриема = Новый Массив;
	
	Для Каждого СтрокаВакцинации Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаЭтапа Из СтрокаВакцинации.ПолучитьЭлементы() Цикл			
			Если СтрокаЭтапа.ПодтвержденаВрачом
				И НачалоДня(СтрокаЭтапа.ФактическаяДата) = НачалоДня(ТекущаяДата())
				И ЗначениеЗаполнено(СтрокаЭтапа.Номенклатура)
			Тогда
				СтруктураСтроки = Новый Структура("Номенклатура", СтрокаЭтапа.Номенклатура);
				Работы.Добавить(СтруктураСтроки);
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла; 
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Клиент", Клиент);
	ЗначенияЗаполнения.Вставить("Работы", Работы);
	
	ОткрытьФорму("Документ.Прием.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
		
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьПриёмПриОтметкеВыполнения(Команда)
	
	СоздаватьПриёмПриОтметкеВыполненияОбновлениеСостояния();
		
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ОтменитьСнятьОтменуЭтаповТекущейСтроки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОтменуСнять(Команда)
	ОтменитьСнятьОтменуЭтаповТекущейСтроки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистр(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		ЗначениеОтбора = Новый Структура("Клиент", Клиент);
		ПараметрыОткрытия.Вставить("Отбор", ЗначениеОтбора);
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ВакцинацияПациентов.ФормаСписка", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискКлиентов(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВакцинацию(Команда)
	
	Если СообщитьКлиентНеЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	Если НазначенныеВакцинации.ПолучитьЭлементы().Количество() = 0 Или Элементы.НазначенныеВакцинации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("УдалитьВакцинациюПродолжение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru='Удалить вакцинацию?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсеПросроченные(Команда)
	
	Если СообщитьКлиентНеЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	// При пустой таблице или не выбранной строке команда не работает
	Если НазначенныеВакцинации.ПолучитьЭлементы().Количество() = 0 Или Элементы.НазначенныеВакцинации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Вопрос(НСтр("ru='Отменить все просроченные?'"), РежимДиалогаВопрос.ДаНет, 0);       
    Если Ответ = КодВозвратаДиалога.Нет Тогда
    	Возврат; 
	КонецЕсли;
	
	Для Каждого СтрокаНазначения Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл
	
		СтрокиЭтапов = СтрокаНазначения.ПолучитьЭлементы();
		Для Каждого СтрокаЭтапа Из СтрокиЭтапов Цикл
			Если СтрокаЭтапа.Состояние = "Просрочена" Тогда
				СтрокаЭтапа.Отменена = Истина;
			КонецЕсли; 
		КонецЦикла;
	КонецЦикла;
	
	СохранитьИзмененияВакцинацийВФорме(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВакцинацию(Команда)
	
	ТекущиеДанные = Элементы.НазначенныеВакцинации.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,ТекущиеДанные.Вакцинация);
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	мКлиентКэш = Клиент;
	ОбновитьДанныеКлиента();
	ЗагрузитьВакцинацииКлиента();
	ОбновитьОтображениеОтмененныхЗавершенных();
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора, мИспользоватьАвтоПодборКлиентовПоКоду);
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора, мИспользоватьАвтоПодборКлиентовПоКоду);
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПриИзменении(Элемент)
	ОбновитьОтображениеОтмененныхЗавершенных(Истина);
КонецПроцедуры

&НаКлиенте
Процедура НазначенныеВакцинацииПодтвержденаВрачомПриИзменении(Элемент)
	
	ТекущиеДанные = Элемент.Родитель.Родитель.ТекущиеДанные;
	
	Если ТекущиеДанные.ПодтвержденаВрачом Тогда
		ТекущиеДанные.ПодтвердившийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
		ТекущиеДанные.ПодтвержденаВрачомДата = ТекущаяДата();
	Иначе
		ТекущиеДанные.ПодтвердившийПользователь = Неопределено;
	КонецЕсли;
	ЗаписатьДанныеВакцинации(НазначенныеВакцинации, Клиент);
		
КонецПроцедуры

&НаКлиенте
Процедура НазначенныеВакцинацииНоменклатураПриИзменении(Элемент)
		
	СтрокаИзмененногоЭтапа = Элементы.НазначенныеВакцинации.ТекущиеДанные;
		
	Если Не ЗначениеЗаполнено(СтрокаИзмененногоЭтапа.Номенклатура) Тогда
		Возврат;
	КонецЕсли;

	Для Каждого СтрокаЭтапа Из СтрокаИзмененногоЭтапа.ПолучитьРодителя().ПолучитьЭлементы() Цикл		
		Если Не ЗначениеЗаполнено(СтрокаЭтапа.Номенклатура) Тогда			
			СтрокаЭтапа.Номенклатура = СтрокаИзмененногоЭтапа.Номенклатура;				
		КонецЕсли;		
	КонецЦикла;
	
	ЗаписатьДанныеВакцинации(НазначенныеВакцинации, Клиент);
		
КонецПроцедуры

&НаКлиенте
Процедура НазначенныеВакцинацииНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДанныеВыбора = ПолучитьСписокНоменклатурВакцинации(Элементы.НазначенныеВакцинации.ТекущиеДанные.Вакцинация);
	Элемент.СписокВыбора.ЗагрузитьЗначения(ДанныеВыбора);
КонецПроцедуры

&НаКлиенте
Процедура НазначенныеВакцинацииКомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МногострочныйВводТекста(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НазначенныеВакцинацииДатаСтартаЭтапаПриИзменении(Элемент)
	Если Элементы.НазначенныеВакцинации.ТекущиеДанные.ДатаСтартаЭтапа = Дата(1,1,1) Тогда
		Элементы.НазначенныеВакцинации.ТекущиеДанные.ДатаСтартаЭтапа = ДатаРождения;
	КонецЕсли;
	ОбновитьСостоянияЭтапов();
	ЗаписатьДанныеВакцинации(НазначенныеВакцинации, Клиент);
КонецПроцедуры

&НаКлиенте
Процедура НазначенныеВакцинацииДатаОкончанияЭтапаПриИзменении(Элемент)
	Если Элементы.НазначенныеВакцинации.ТекущиеДанные.ДатаОкончанияЭтапа = Дата(1,1,1) Тогда
		Элементы.НазначенныеВакцинации.ТекущиеДанные.ДатаОкончанияЭтапа = ДатаРождения;
	КонецЕсли;
	ОбновитьСостоянияЭтапов();
	ЗаписатьДанныеВакцинации(НазначенныеВакцинации, Клиент);
КонецПроцедуры

&НаКлиенте
Процедура МногострочныйВводТекста(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяТаблицы			= Элемент.Родитель.Имя;
	ИдентификаторСтроки = Элемент.Родитель.ТекущаяСтрока;
	ИмяЭлемента			= Элемент.Имя;
	ИмяРеквизита		= Прав(ИмяЭлемента, СтрДлина(ИмяЭлемента) - СтрДлина(ИмяТаблицы));
	ТекущаяСтрока		= ЭтаФорма[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	Текст				= ТекущаяСтрока[ИмяРеквизита];
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	ДопПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
	ДопПараметры.Вставить("ИмяТаблицы", ИмяТаблицы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Текст", Текст);
	ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);

	Оповещение = Новый ОписаниеОповещения("ПослеВводаТекста", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВводМногострочногоТекстаТабличнойЧасти", ПараметрыФормы, , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздаватьПриёмПриОтметкеВыполненияОбновлениеСостояния(УстановитьСостояние = Ложь)
	
	Элемент = Элементы.НазначенныеВакцинацииСоздаватьПриёмПриОтметкеВыполнения;
	
	Если УстановитьСостояние Тогда
		Элемент.Пометка = СоздаватьПриёмПриОтметкеВыполнения;
	Иначе
		ЭтаФорма.СохраняемыеВНастройкахДанныеМодифицированы = Истина;
		Элемент.Пометка = Не Элемент.Пометка;
		СоздаватьПриёмПриОтметкеВыполнения = Элемент.Пометка;
	КонецЕсли;	
			
	Элемент.Картинка = ?(Элемент.Пометка, ПолучитьКартинку("УстановленнаяПометка"), ПолучитьКартинку("СнятаяПометка"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокНоменклатурВакцинации(Вакцинация)
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакцинация", Вакцинация);
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	НоменклатураВакцинации.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.Вакцинации.НоменклатураВакцинации КАК НоменклатураВакцинации
	|ГДЕ
	|	НоменклатураВакцинации.Ссылка = &Вакцинация
	|	И НЕ НоменклатураВакцинации.Номенклатура.ПометкаУдаления
	|	И НЕ НоменклатураВакцинации.Номенклатура.Архив
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураВакцинации.НомерСтроки";
	
	// Возвращаем массив номенклатур результата запроса.
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКартинку(ИмяКартинки)
	
	Возврат БиблиотекаКартинок[ИмяКартинки];
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеКлиента()
	
	ДатаРождения = Клиент.ДатаРождения;
	
	Если ЗначениеЗаполнено(Клиент) И ЗначениеЗаполнено(Клиент.ЗаконныйПредставитель) Тогда
		ЗаконныйПредставитель = Клиент.ЗаконныйПредставитель;
	Иначе
		ЗаконныйПредставитель = Справочники.Клиенты.ПустаяСсылка();	
	КонецЕсли;
	
	// Возраст клиента
	ДатаРожденияСтрока = Формат(ДатаРождения,  "ДФ=dd.MM.yyyy");
	Возраст = ОбщегоНазначенияКлиентСервер.ПолучитьВозрастСтрокой(Клиент.ДатаРождения);
	ТекстДекорацииВозраст = "";
	ТекстДекорацииВозраст = ТекстДекорацииВозраст + ?(ЗначениеЗаполнено(ДатаРожденияСтрока), НСтр("ru='Дата рождения: '") + ДатаРожденияСтрока, "");
	ТекстДекорацииВозраст = ТекстДекорацииВозраст + ?(ЗначениеЗаполнено(Возраст), " ( " + Возраст + " )", "");
	ОбновитьДекорацию(Элементы.ДекорацияВозраст, ТекстДекорацииВозраст);
	
	// Телефоны клиента
	ЗаголовокТелефон = НСтр("ru='Тел.: '");
	
	МассивНомеровТелефонов = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Клиент,,, Ложь, Ложь);
	СписокНомеровТелефонов = Новый СписокЗначений;
	СписокНомеровТелефонов.ЗагрузитьЗначения(МассивНомеровТелефонов);
	ТекстДекорацииТелефоныКлиента = ?(ЗначениеЗаполнено(СписокНомеровТелефонов), ЗаголовокТелефон + СписокНомеровТелефонов, "");
	ОбновитьДекорацию(Элементы.ДекорацияТелефоныКлиента, ТекстДекорацииТелефоныКлиента);
	
	// Телефоны законного представителя
	Если ТипЗнч(ЗаконныйПредставитель) = Тип("СправочникСсылка.Клиенты") Тогда
		МассивНомеровТелефонов = КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(ЗаконныйПредставитель,,, Ложь, Ложь);
		ТекстДекорацииТелефоныЗаконнгоПредставителя = СтрСоединить(МассивНомеровТелефонов, ", ");
		Если ЗначениеЗаполнено(ТекстДекорацииТелефоныЗаконнгоПредставителя) Тогда
			ТекстДекорацииТелефоныЗаконнгоПредставителя = ЗаголовокТелефон + ТекстДекорацииТелефоныЗаконнгоПредставителя;
		КонецЕсли;
	Иначе
		ТекстДекорацииТелефоныЗаконнгоПредставителя = ?(ЗначениеЗаполнено(Клиент.ЗаконныйПредставительТелефон), ЗаголовокТелефон + Клиент.ЗаконныйПредставительТелефон, "");
	КонецЕсли;
	ОбновитьДекорацию(Элементы.ДекорацияТелефоныЗаконногоПредставителя, ТекстДекорацииТелефоныЗаконнгоПредставителя);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДекорацию(Декорация, НовыйЗаголовок)
	
	Если ЗначениеЗаполнено(НовыйЗаголовок) Тогда	
		ТекущийЗаголовок = Декорация.Заголовок;
		Если НовыйЗаголовок <> ТекущийЗаголовок Тогда
			Декорация.Заголовок = НовыйЗаголовок;
		КонецЕсли;
	Иначе
		Декорация.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаТекста(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ТекущаяСтрока = ЭтаФорма[Результат.ДопПараметры.ИмяТаблицы].НайтиПоИдентификатору(Результат.ДопПараметры.ИдентификаторСтроки);
		ТекущаяСтрока[Результат.ДопПараметры.ИмяРеквизита] = Результат.Текст;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВакцинациюПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ВыбранаПлановаяПоВозрасту = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Результат, "Плановая");
	
	Если ВыбранаПлановаяПоВозрасту И Не ЗначениеЗаполнено(ДатаРождения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно добавить вакцинацию плановую по возрасту: у клиента не заполнена дата рождения'"));
		Возврат;
	КонецЕсли;
	
	ДобавитьВакцинациюИЭтапы(Результат);
	ОбновитьОтображениеОтмененныхЗавершенных();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМедотводПослеВводаСрока(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Месяцев		= Результат.Месяцев + Результат.Лет *12;
		СтрокаЭтапа	= НазначенныеВакцинации.НайтиПоИдентификатору(Результат.НомерСтроки);
		
		СтрокаЭтапа.ДатаСтартаЭтапа	= ДобавитьМесяц(СтрокаЭтапа.ДатаСтартаЭтапа, Месяцев) + Результат.Дней *60*60*24;
		
		Если СтрокаЭтапа.ДатаОкончанияЭтапа <> ДатаРождения Тогда
			СтрокаЭтапа.ДатаОкончанияЭтапа = ДобавитьМесяц(СтрокаЭтапа.ДатаОкончанияЭтапа, Месяцев) + Результат.Дней *60*60*24;
		КонецЕсли;
		
	КонецЕсли;
	
	СохранитьИзмененияВакцинацийВФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВакцинациюПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
    Если Ответ = КодВозвратаДиалога.Нет Тогда
    	Возврат; 
    КонецЕсли; 
	
	СтрокаНазначения = Элементы.НазначенныеВакцинации.ТекущиеДанные;
	
	Если СтрокаНазначения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаВакцинации = СтрокаНазначения.ПолучитьРодителя();
	Если СтрокаВакцинации = Неопределено Тогда
		СтрокаВакцинации = СтрокаНазначения;
	КонецЕсли; 
	
	ЕстьВыполненный = Ложь;
	Для Каждого СтрокаЭтапа Из СтрокаВакцинации.ПолучитьЭлементы() Цикл
		Если СтрокаЭтапа.Состояние = "Выполнена" Тогда
			ЕстьВыполненный = Истина;
		Иначе
			СтрокаЭтапа.Отменена = Истина;
		КонецЕсли;
	КонецЦикла;	
	Если Не ЕстьВыполненный Тогда
		УдалитьВакцинациюКлиента(Клиент, СтрокаВакцинации.Вакцинация);
		НазначенныеВакцинации.ПолучитьЭлементы().Удалить(СтрокаВакцинации);
	КонецЕсли;
	
	СохранитьИзмененияВакцинацийВФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыполнениеВПрошлом(ВыполненаВСтороннейОрганизации = Истина)
	
	Если СообщитьКлиентНеЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	// При пустой таблице и для строк уровня вакцинации команда не работает
	Если НазначенныеВакцинации.ПолучитьЭлементы().Количество() = 0 Или Элементы.НазначенныеВакцинации.ТекущиеДанные = Неопределено Или Элементы.НазначенныеВакцинации.ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОтметитьВыполнениеВПрошломПослеВводаДаты", ЭтотОбъект, Новый Структура("ВыполненаВСтороннейОрганизации", ВыполненаВСтороннейОрганизации));
	ПоказатьВводЗначения(Оповещение,, НСтр("ru='Введите дату выполнения'"),Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВыполнениеВПрошломПослеВводаДаты(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаВыполнения = ?(ЗначениеЗаполнено(Результат), Результат, Дата(1900,1,1));
	
	ЗначенияРеквизитовЭтапа = Новый Структура();
	ЗначенияРеквизитовЭтапа.Вставить("ФактическаяДата",					 ?(ЗначениеЗаполнено(Результат), Результат, Дата(1900,1,1)));
	ЗначенияРеквизитовЭтапа.Вставить("ВыполнившийПользователь",			 ПользователиКлиентСервер.ТекущийПользователь());
	ЗначенияРеквизитовЭтапа.Вставить("ВыполненаВСтороннейОрганизации",	 ДополнительныеПараметры.ВыполненаВСтороннейОрганизации);
	ЗначенияРеквизитовЭтапа.Вставить("ПодтвержденаВрачом",				 Неопределено);
	ЗначенияРеквизитовЭтапа.Вставить("ПодтвержденаВрачомДата",			 Неопределено);
	ЗначенияРеквизитовЭтапа.Вставить("Номенклатура",					 Неопределено);
	ЗначенияРеквизитовЭтапа.Вставить("Отменена",						 Ложь);
	
	СтрокаТекущегоЭтапа = Элементы.НазначенныеВакцинации.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(СтрокаТекущегоЭтапа, ЗначенияРеквизитовЭтапа);
	
	// После отметки текущей строки идём выше и отмечаем выполнение всех просроченных этапов.
	СтрокаВакцинации = СтрокаТекущегоЭтапа.ПолучитьРодителя();
	СтрокиНазначений = СтрокаВакцинации.ПолучитьЭлементы();
	ИндексТекущейСтроки = СтрокиНазначений.Индекс(СтрокаТекущегоЭтапа);
	Если ИндексТекущейСтроки <> 0 Тогда
		
		Для Сч = 0 По ИндексТекущейСтроки-1 Цикл
			
			СтрокаЭтапа = СтрокиНазначений[ИндексТекущейСтроки-1-Сч];
			Если СтрокаЭтапа.Состояние = "Просрочена" Тогда
				// Выше текущей строки нашли еще просроченный этап - отмечаем как выполненный.
				ЗаполнитьЗначенияСвойств(СтрокаЭтапа, ЗначенияРеквизитовЭтапа,,"ФактическаяДата");
				
			ИначеЕсли СтрокаЭтапа.Состояние = "Выполнена" Тогда
				// Если выше текущей встретили выполненный этап, то еще выше не идёт отмечать выполнение.
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СохранитьИзмененияВакцинацийВФорме(Истина);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьВакцинациюИЭтапы(Вакцинация, СохранитьВБазу = Истина, НазначенныеВакцинацииКопия = Неопределено)
	
	Перем Номенклатура;
	
	Если Не ЗначениеЗаполнено(Вакцинация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВерхнийУровеньВакцинаций = ?(НазначенныеВакцинацииКопия = Неопределено, НазначенныеВакцинации.ПолучитьЭлементы(), НазначенныеВакцинацииКопия.ПолучитьЭлементы());
	
	// Сначала проверим наличие уже добавленой вакцинации
	ЭтоДубль = Ложь;
	Для Каждого СтрокаВакцинации Из ВерхнийУровеньВакцинаций Цикл		
		Если СтрокаВакцинации.Вакцинация = Вакцинация Тогда
			// Это дубль
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Вакцинация
	НоваяСтрокаВакцинации					 = ВерхнийУровеньВакцинаций.Добавить();
	НоваяСтрокаВакцинации.Вакцинация		 = Вакцинация;
	НоваяСтрокаВакцинации.Осложнения		 = Вакцинация.Осложнения;
	НоваяСтрокаВакцинации.ВакцинацияПлановая = Вакцинация.Плановая;
	
	СписокНоменкулатурВакцинации = ПолучитьСписокНоменклатурВакцинации(Вакцинация);
	Если СписокНоменкулатурВакцинации.Количество() = 1 Тогда
		Номенклатура = СписокНоменкулатурВакцинации[0];
	КонецЕсли;
	ЕстьНоменклатура = СписокНоменкулатурВакцинации.Количество() <> 0;
	
	// Этапы
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ВакцинацииЭтапы.Ссылка КАК Ссылка,
	|	ВакцинацииЭтапы.НомерСтроки КАК НомерСтроки,
	|	ВакцинацииЭтапы.ДнейДоСтартаЭтапа КАК ДнейДоСтартаЭтапа,
	|	ВакцинацииЭтапы.МесяцевДоСтартаЭтапа КАК МесяцевДоСтартаЭтапа,
	|	ВакцинацииЭтапы.ДнейДоОкончанияЭтапа КАК ДнейДоОкончанияЭтапа,
	|	ВакцинацииЭтапы.МесяцевДоОкончанияЭтапа КАК МесяцевДоОкончанияЭтапа,
	|	ВакцинацииЭтапы.НазначаетсяВручную КАК НазначаетсяВручную,
	|	ВакцинацииЭтапы.Осложнения КАК Осложнения,
	|	ВакцинацииЭтапы.Комментарий КАК Комментарий
	|ИЗ
	|	Справочник.Вакцинации.Этапы КАК ВакцинацииЭтапы
	|ГДЕ
	|	ВакцинацииЭтапы.Ссылка = &Вакцинация";
	
	Запрос.УстановитьПараметр("Вакцинация", Вакцинация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаЭтап = НоваяСтрокаВакцинации.ПолучитьЭлементы().Добавить();
		НоваяСтрокаЭтап.Вакцинация				= Вакцинация;
		НоваяСтрокаЭтап.Этап					= Выборка.НомерСтроки;
		НоваяСтрокаЭтап.Осложнения				= Выборка.Осложнения;
		НоваяСтрокаЭтап.Комментарий				= Выборка.Комментарий;
		НоваяСтрокаЭтап.Номенклатура = Номенклатура;
		НоваяСтрокаЭтап.ЕстьНоменклатура = ЕстьНоменклатура;
		НоваяСтрокаЭтап.НазначившийПользователь	= ОбщегоНазначения.ТекущийПользователь();
		Если Выборка.НазначаетсяВручную  Тогда
			НоваяСтрокаЭтап.Отменена = Истина
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Клиент) И ЗначениеЗаполнено(Клиент.ДатаРождения) Тогда
			НоваяСтрокаЭтап.ДатаСтартаЭтапа		= ДобавитьМесяц(Клиент.ДатаРождения, Выборка.МесяцевДоСтартаЭтапа)  + Выборка.ДнейДоСтартаЭтапа *60*60*24;
		    НоваяСтрокаЭтап.ДатаОкончанияЭтапа	= ПолучитьДатуОкончанияЭтапаПоЧастямСрока(Выборка.МесяцевДоСтартаЭтапа, Выборка.ДнейДоОкончанияЭтапа, Клиент.ДатаРождения);
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнить состояния этапов, записать изменение в базу.
	Если НазначенныеВакцинацииКопия = Неопределено Тогда
		
		ОбновитьСостояния(НазначенныеВакцинации, ДатаРождения);
		
		Если СохранитьВБазу Тогда
			ЗаписатьДанныеВакцинации(НазначенныеВакцинации, Клиент);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДатуОкончанияЭтапаПоЧастямСрока(Месяцев, Дней, Знач ДатаРождения)
	
	ДатаРождения = НачалоДня(ДатаРождения);
	
	Если Дней <> 0 Тогда
		ДатаОкончания = ДобавитьМесяц(ДатаРождения, Месяцев) + Дней*60*60*24;
		
	Иначе
		Лет = Цел(Месяцев/12);
		МесяцевВГоду = Месяцев - Лет * 12;
		
		Если МесяцевВГоду <> 0 Тогда
			// До конца месяца.
			ДатаОкончания = ДобавитьМесяц(ДатаРождения, Месяцев + 1) - 1;
		Иначе
			// До конца года.
			ДатаОкончания = ДобавитьМесяц(ДатаРождения, Месяцев + 12) - 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДатаОкончания;
	
КонецФункции

&НаКлиенте
Процедура ОтменитьСнятьОтменуЭтаповТекущейСтроки(РежимОтмены = Истина)
	
	Если СообщитьКлиентНеЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	// При пустой таблице или не выбранной строке команда не работает
	Если НазначенныеВакцинации.ПолучитьЭлементы().Количество() = 0 Или Элементы.НазначенныеВакцинации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаНазначения	= Элементы.НазначенныеВакцинации.ТекущиеДанные;
	ТекущийПользователь	= ПользователиКлиентСервер.ТекущийПользователь();
	
	Если РежимОтмены Тогда
		ТекстВопросаОбработатьВсеЭтапы = НСтр("ru='Отменить все этапы вакцинации?'");
		ЗначениеРеквизитов = Новый Структура("Отменена, ВыполнившийПользователь, ФактическаяДата, ВыполненаВСтороннейОрганизации",
												Истина, ТекущийПользователь, Дата(1,1,1), Ложь);
	Иначе
		ТекстВопросаОбработатьВсеЭтапы = НСтр("ru='Снять отмену со всех этапов вакцинации?'");
		ЗначениеРеквизитов = Новый Структура("Отменена", Ложь);
	КонецЕсли;
	
	СтрокиДляОбработки = Новый Массив;
	Если СтрокаНазначения.ПолучитьРодителя() <> Неопределено Тогда
		СтрокиДляОбработки.Добавить(СтрокаНазначения);
	Иначе
		Ответ = Вопрос(ТекстВопросаОбработатьВсеЭтапы, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Для Каждого СтрокаЭтапа Из СтрокаНазначения.ПолучитьЭлементы() Цикл
				СтрокиДляОбработки.Добавить(СтрокаЭтапа);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Продолжаем выполнение операции
	Если СтрокиДляОбработки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОперацияВыполнена = Ложь;
	
	Для Каждого СтрокаЭтапа Из СтрокиДляОбработки Цикл
		Если РежимОтмены И Не ЗначениеЗаполнено(СтрокаЭтапа.ФактическаяДата)
			Или Не РежимОтмены И СтрокаЭтапа.Отменена
		Тогда
			ЗаполнитьЗначенияСвойств(СтрокаЭтапа, ЗначениеРеквизитов);
			ОперацияВыполнена = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ОперацияВыполнена Тогда
		СохранитьИзмененияВакцинацийВФорме(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостоянияЭтапов(УдалятьПросроченныеВакцинации = Ложь)
	ОбновитьСостояния(НазначенныеВакцинации, ДатаРождения, УдалятьПросроченныеВакцинации);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСостояния(НазначенныеВакцинации, ДатаРождения, УдалятьПросроченныеВакцинации = Ложь)
	
	Для Каждого СтрокаВакцинации Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл
		
		УдалитьВакцинацию = УдалятьПросроченныеВакцинации;
		
		Для Каждого СтрокаЭтапа Из СтрокаВакцинации.ПолучитьЭлементы() Цикл
			
			Если ЗначениеЗаполнено(СтрокаЭтапа.ФактическаяДата) Тогда
				СтрокаЭтапа.Состояние = "Выполнена";
			ИначеЕсли СтрокаЭтапа.Отменена Тогда
				СтрокаЭтапа.Состояние = "Отменена";
			ИначеЕсли СтрокаЭтапа.ДатаОкончанияЭтапа <= ТекущаяДата()
					И СтрокаЭтапа.ДатаОкончанияЭтапа <> ДатаРождения
					И СтрокаЭтапа.ДатаОкончанияЭтапа <> Дата(1,1,1)
			Тогда
				СтрокаЭтапа.Состояние = "Просрочена";
			Иначе
				СтрокаЭтапа.Состояние = "Назначена";
			КонецЕсли;
			
			УстановитьПредставлениеСостояния(СтрокаЭтапа);
			
			УдалитьВакцинацию = УдалитьВакцинацию И СтрокаЭтапа.Состояние = "Просрочена";
		КонецЦикла;
		
		Если УдалитьВакцинацию Тогда
			НазначенныеВакцинации.ПолучитьЭлементы().Удалить(СтрокаВакцинации);			
		КонецЕсли; 
	КонецЦикла;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСостояния(СтрокаЭтапа)
	
	Если СтрокаЭтапа.Состояние = "Отменена" Тогда
		СтрокаЭтапа.СостояниеПредставление = НСтр("ru='Отменена'");
	ИначеЕсли СтрокаЭтапа.Состояние = "Просрочена" Тогда
		СтрокаЭтапа.СостояниеПредставление = НСтр("ru='Просрочена'");
	ИначеЕсли СтрокаЭтапа.Состояние = "Назначена" Тогда
		СтрокаЭтапа.СостояниеПредставление = НСтр("ru='Назначена'");
	ИначеЕсли СтрокаЭтапа.Состояние = "Выполнена" Тогда
		Если СтрокаЭтапа.ВыполненаВСтороннейОрганизации Тогда
			СтрокаЭтапа.СостояниеПредставление = НСтр("ru='Выполнена (др)'");
		Иначе
			СтрокаЭтапа.СостояниеПредставление = НСтр("ru='Выполнена'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВакцинацииКлиента()
	
	НазначенныеВакцинации.ПолучитьЭлементы().Очистить();
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ВакцинацияПациентов.СоздатьНаборЗаписей();
	НЗ.Отбор.Клиент.Установить(Клиент);
	НЗ.Прочитать();
	
	ВакцинацииПациента = НЗ.Выгрузить();
	ВакцинацииПациента.Сортировать("ПлановаяДатаНачала, ПлановаяДатаЗавершения, Вакцинация");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ВакцинацииЭтапы.Ссылка КАК Вакцинация,
	|	ВакцинацииЭтапы.НомерСтроки КАК Этап,
	|	ВакцинацииЭтапы.Осложнения КАК Осложнения
	|ИЗ
	|	Справочник.Вакцинации.Этапы КАК ВакцинацииЭтапы";
	
	ТЗОсложненения = Запрос.Выполнить().Выгрузить();
	НоменклатураВакцинации = Новый Соответствие;
	
	Для Каждого Запись Из ВакцинацииПациента Цикл
		
		// Поиск добавленой строки вакцинации
		НайденнаяСтрокаВакцинации = Неопределено;
		Для Каждого СтрокаВакцинации Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл
			Если СтрокаВакцинации.Вакцинация = Запись.Вакцинация Тогда
				НайденнаяСтрокаВакцинации = СтрокаВакцинации;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		// Определяем, есть ли номенклатура у вакцинации
		Если НоменклатураВакцинации.Получить(Запись.Вакцинация) = Неопределено Тогда
			НоменклатураВакцинации.Вставить(Запись.Вакцинация, ПолучитьСписокНоменклатурВакцинации(Запись.Вакцинация));
		КонецЕсли;
		
		// Вакцинация
		НоваяСтрокаВакцинации							= ?(НайденнаяСтрокаВакцинации <> Неопределено, НайденнаяСтрокаВакцинации, НазначенныеВакцинации.ПолучитьЭлементы().Добавить());
		НоваяСтрокаВакцинации.Вакцинация				= Запись.Вакцинация;
		НоваяСтрокаВакцинации.Осложнения				= Запись.Вакцинация.Осложнения;
		НоваяСтрокаВакцинации.ВакцинацияПлановая		= Запись.Вакцинация.Плановая;
		
		// Этапы
		НоваяСтрокаЭтап									= НоваяСтрокаВакцинации.ПолучитьЭлементы().Добавить();
		НоваяСтрокаЭтап.Вакцинация						= Запись.Вакцинация;
		НоваяСтрокаЭтап.Номенклатура					= Запись.Номенклатура;
		НоваяСтрокаЭтап.ЕстьНоменклатура				= НоменклатураВакцинации.Получить(Запись.Вакцинация).Количество() <> 0;
		НоваяСтрокаЭтап.Этап							= Запись.Этап;
		НоваяСтрокаЭтап.Комментарий						= Запись.Комментарий;
		НоваяСтрокаЭтап.ДатаСтартаЭтапа					= Запись.ПлановаяДатаНачала;
		НоваяСтрокаЭтап.ДатаОкончанияЭтапа				= Запись.ПлановаяДатаЗавершения;
		НоваяСтрокаЭтап.ФактическаяДата					= Запись.ФактическаяДата;
		НоваяСтрокаЭтап.Отменена						= Запись.Отменена;
		НоваяСтрокаЭтап.ПодтвержденаВрачом				= ?(Запись.ПодтвержденаВрачом + 24*60*60 >= ТекущаяДата(), Истина, Ложь);
		НоваяСтрокаЭтап.ПодтвержденаВрачомДата			= Запись.ПодтвержденаВрачом;
		НоваяСтрокаЭтап.НазначившийПользователь			= Запись.НазначившийПользователь;
		НоваяСтрокаЭтап.ПодтвердившийПользователь		= Запись.ПодтвердившийПользователь;
		НоваяСтрокаЭтап.ВыполнившийПользователь			= Запись.ВыполнившийПользователь;
		НоваяСтрокаЭтап.ВыполненаВСтороннейОрганизации	= Запись.ВыполненаВСтороннейОрганизации;
		НоваяСтрокаЭтап.ЛистОжидания					= Запись.ЛистОжидания;
		НоваяСтрокаЭтап.ЛистОжиданияВыполнен			= Запись.ЛистОжидания.Выполнен;
		Если НоваяСтрокаЭтап.ПодтвержденаВрачом Тогда
			НоваяСтрокаЭтап.ПодтвержденаВрачомДата		= Запись.ПодтвержденаВрачом;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Вакцинация", Запись.Вакцинация);
		СтруктураОтбора.Вставить("Этап", Запись.Этап);
		Строки = ТЗОсложненения.НайтиСтроки(СтруктураОтбора);
		
		Если Строки.Количество() > 0 Тогда
			НоваяСтрокаЭтап.Осложнения = Строки[0].Осложнения;
		КонецЕсли;
		
	КонецЦикла;
	
	// Сортировка по номеру этапа
	ДеревоНазначений = РеквизитФормыВЗначение("НазначенныеВакцинации");
	Для Каждого СтрокаВакцинации Из ДеревоНазначений.Строки Цикл
		СтрокаВакцинации.Строки.Сортировать("Этап");
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоНазначений, "НазначенныеВакцинации");
	
	ОбновитьСостояния(НазначенныеВакцинации, ДатаРождения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеВакцинации(Знач НазначенныеВакцинации, Клиент)
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран клиент'"), , "Клиент");
		Возврат;
	КонецЕсли;
	
	// Сначала создаем/обновляем листы ожидания
	Для Каждого СтрокаВакцинации Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл
		
		ПоследнийЗавершенныйЭтап = 0;		
		Для Каждого СтрокаЭтапа Из СтрокаВакцинации.ПолучитьЭлементы() Цикл			
			Если ЗначениеЗаполнено(СтрокаЭтапа.ЛистОжидания) И СтрокаЭтапа.ЛистОжиданияВыполнен Тогда
				// На данном этапе уже есть выполненный ЛО, его не нужно обрабатывать.
				ПоследнийЗавершенныйЭтап = ?(ПоследнийЗавершенныйЭтап < СтрокаЭтапа.Этап, СтрокаЭтапа.Этап, ПоследнийЗавершенныйЭтап);	
			Иначе
				// Нашли этап по которому требуется обработать ЛО.
				Отказ = Ложь;
				СоздатьОбновитьЛистОжидания(Клиент, СтрокаЭтапа, ПоследнийЗавершенныйЭтап, Отказ);
				Если Отказ Тогда
					Если Ложь Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для вакцинации " + СтрокаВакцинации.Вакцинация + " текущий этап просрочен, лист ожидания не создан. Сдвиньте или отмените этап.");
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;
		
	КонецЦикла;
	
	// Потом пишем в регистр вакцинаций
	НЗ = РегистрыСведений.ВакцинацияПациентов.СоздатьНаборЗаписей();
	НЗ.Отбор.Клиент.Установить(Клиент);
	Для Каждого СтрокаВакцинации Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаЭтапа Из СтрокаВакцинации.ПолучитьЭлементы() Цикл
			
			Запись = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаЭтапа);
			Запись.Клиент					= Клиент;
			Запись.ПлановаяДатаНачала		= СтрокаЭтапа.ДатаСтартаЭтапа;
			Запись.ПлановаяДатаЗавершения	= СтрокаЭтапа.ДатаОкончанияЭтапа;
			
			Если СтрокаЭтапа.ПодтвержденаВрачом Тогда
				Запись.ПодтвержденаВрачом	= СтрокаЭтапа.ПодтвержденаВрачомДата;
			Иначе
				Запись.ПодтвержденаВрачом	= Дата(1,1,1);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	НЗ.Записать(Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьОбновитьЛистОжидания(Клиент, СтрокаЭтапа, ПоследнийЗавершенныйЭтап, Отказ)
	
	// Пропускаем обработку для еще не актуальных этапов.
	Если СтрокаЭтапа.Этап > ПоследнийЗавершенныйЭтап + 1 Тогда	
		Возврат;
	КонецЕсли;
	
	// Если очередной этап просроченный, то прекращаем обработку.
	Если СтрокаЭтапа.Состояние = "Просрочена" Тогда
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	// Если нашли отмененный или выполненный этап.  
	Если СтрокаЭтапа.Состояние = "Отменена" 
		Или СтрокаЭтапа.Состояние = "Выполнена"
	Тогда
		Если ЗначениеЗаполнено(СтрокаЭтапа.ЛистОжидания) Тогда
			ЛистОжиданияОбъект = СтрокаЭтапа.ЛистОжидания.ПолучитьОбъект();
			ЛистОжиданияОбъект.Выполнен = Истина;
			ЛистОжиданияОбъект.Записать(РежимЗаписиДокумента.Запись);
			СтрокаЭтапа.ЛистОжиданияВыполнен = Истина;
		КонецЕсли;
		
		ПоследнийЗавершенныйЭтап = ?(ПоследнийЗавершенныйЭтап < СтрокаЭтапа.Этап, СтрокаЭтапа.Этап, ПоследнийЗавершенныйЭтап);	
	Иначе
		// Если дошли до этого момента, значит нашли атуальный этап, получаем ЛО.
		Если УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ИспользоватьЛистыОжиданияЗаписи")
			И УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВакцинацииСоздаютЛистыОжидания")
		Тогда
			ЛистОжиданияОбъект = ?(ЗначениеЗаполнено(СтрокаЭтапа.ЛистОжидания), СтрокаЭтапа.ЛистОжидания.ПолучитьОбъект(), Документы.ЛистОжидания.СоздатьДокумент());
			ЛистОжиданияОбъект.Дата = ?(ЗначениеЗаполнено(ЛистОжиданияОбъект.Дата), ЛистОжиданияОбъект.Дата, ТекущаяДата());
			
			ЛистОжиданияОбъект.Клиент = Клиент;
			ЛистОжиданияОбъект.ДатаНачалаПлан = СтрокаЭтапа.ДатаСтартаЭтапа;
			ЛистОжиданияОбъект.ДатаОкончанияПлан = СтрокаЭтапа.ДатаОкончанияЭтапа;
			ЛистОжиданияОбъект.Примечание = ?(ЗначениеЗаполнено(ЛистОжиданияОбъект.Примечание), ЛистОжиданияОбъект.Примечание, "Пригласить для прохождения вакцинации");
			Если ЗначениеЗаполнено(СтрокаЭтапа.Номенклатура) Тогда
				ЛистОжиданияОбъект.Работы.Добавить().Номенклатура = СтрокаЭтапа.Номенклатура;	
			КонецЕсли; 		
			
			Если СтрокаЭтапа.ДатаОкончанияЭтапа = Клиент.ДатаРождения Тогда
				ЛистОжиданияОбъект.ДатаОкончанияПлан = Дата(1,1,1);
			КонецЕсли;
			
			// Причина записи (из этапа вакцинации либо дефолтная).
			Этапы = СтрокаЭтапа.Вакцинация.Этапы;
			Если Этапы.Количество() >= СтрокаЭтапа.Этап Тогда
				ПричинаЗаписиВЛистОжидания = СтрокаЭтапа.Вакцинация.Этапы.Получить(СтрокаЭтапа.Этап - 1).ПричинаЗаписиВЛистОжидания;
			Иначе
				ПричинаЗаписиВЛистОжидания = Неопределено;
			КонецЕсли;
			ЛистОжиданияОбъект.ПричинаЗаписи = ?(ЗначениеЗаполнено(ПричинаЗаписиВЛистОжидания),ПричинаЗаписиВЛистОжидания,Справочники.ПричиныЗаписиНаПрием.Вакцинация);
			
			// Записываем изменения
			ЛистОжиданияОбъект.Записать(РежимЗаписиДокумента.Запись);
			СтрокаЭтапа.ЛистОжидания = ЛистОжиданияОбъект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПлановыеНаСервере(Знач НазначенныеВакцинацииКопия)
	
	ИнформацияОДобавляемых = Новый Структура("ВакцинацииДляДобавления, НазначенныеВакцинацииКопия", Новый СписокЗначений);
	ИнформацияОДобавляемых.НазначенныеВакцинацииКопия = НазначенныеВакцинацииКопия;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	Вакцинации.Ссылка КАК Ссылка,
	|	Вакцинации.Представление КАК Представление
	|ИЗ
	|	Справочник.Вакцинации КАК Вакцинации
	|ГДЕ
	|	НЕ Вакцинации.ПометкаУдаления
	|	И Вакцинации.Плановая
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НовыеВакцинации = Новый СписокЗначений;
	ТаблицаСортировки = Новый ТаблицаЗначений;
	ТаблицаСортировки.Колонки.Добавить("Значение");
	ТаблицаСортировки.Колонки.Добавить("Представление");
	ТаблицаСортировки.Колонки.Добавить("Пометка");
	Пока Выборка.Следующий() Цикл
		Если ДобавитьВакцинациюИЭтапы(Выборка.Ссылка, Ложь, ИнформацияОДобавляемых.НазначенныеВакцинацииКопия) Тогда
			
			ВсяПросрочена = ВакцинацияВсяПросрочена(Выборка.Ссылка, ИнформацияОДобавляемых.НазначенныеВакцинацииКопия, Истина);
			Представление = Выборка.Представление + ?(ВсяПросрочена, " (" + НСтр("ru='просрочена'") + ")","");
			
			СтрокаТаблицы = ТаблицаСортировки.Добавить();
			СтрокаТаблицы.Значение		 = Выборка.Ссылка;
			СтрокаТаблицы.Представление	 = Представление;
			СтрокаТаблицы.Пометка		 = Не ВсяПросрочена;
		КонецЕсли;
	КонецЦикла;
	
	// Переносим отсортированную таблицу в список значений
	ТаблицаСортировки.Сортировать("Пометка УБЫВ, Представление");
	Для Каждого СтрокаТаблицы Из ТаблицаСортировки Цикл
		ИнформацияОДобавляемых.ВакцинацииДляДобавления.Добавить(СтрокаТаблицы.Значение, СтрокаТаблицы.Представление, СтрокаТаблицы.Пометка);
	КонецЦикла;
	
	Возврат ИнформацияОДобавляемых;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПлановыеПослеВыбораНужных(РезультатВыбора, ИнформацияОДобавляемых) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("СписокЗначений") Тогда
		
		НазначенныеВакцинацииКопия = ИнформацияОДобавляемых.НазначенныеВакцинацииКопия;
		
		// Удаление тех, что были добавлены, но не были подтверждены к выбору.
		Для Каждого ЭлементСписка Из РезультатВыбора Цикл
			
			Если ЭлементСписка.Пометка Тогда
				
				Для Каждого СтрокаВакцинации Из НазначенныеВакцинацииКопия.ПолучитьЭлементы() Цикл
					Если СтрокаВакцинации.Вакцинация = ЭлементСписка.Значение Тогда
						
						НоваяСтрокаВакцинации = НазначенныеВакцинации.ПолучитьЭлементы().Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаВакцинации, СтрокаВакцинации);
						
						Для Каждого СтрокаЭтапа Из СтрокаВакцинации.ПолучитьЭлементы() Цикл
							НоваяСтрокаЭтапа = НоваяСтрокаВакцинации.ПолучитьЭлементы().Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрокаЭтапа, СтрокаЭтапа);
						КонецЦикла;
						
						Прервать;	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	
		// Запись, сортировка и оформление списка вакцинаций.
		ЗаполнитьПлановыеЗавершение();
		ОбновитьОтображениеОтмененныхЗавершенных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВакцинациюИзДерева(Вакцинация, Записывать = Ложь)
	
	УровеньВакцинаций = НазначенныеВакцинации.ПолучитьЭлементы();
	Для Каждого СтрокаВакцинации Из УровеньВакцинаций Цикл
		Если СтрокаВакцинации.Вакцинация = Вакцинация Тогда
			УровеньВакцинаций.Удалить(СтрокаВакцинации);
			
			Если Записывать Тогда
				ЗаписатьДанныеВакцинации(НазначенныеВакцинации, Клиент);
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыеЗавершение()
	
	ЗаписатьДанныеВакцинации(НазначенныеВакцинации, Клиент);
	ЗагрузитьВакцинацииКлиента(); // Грубая сортировка.
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВакцинацияВсяПросрочена(Вакцинация, Знач НазначенныеВакцинации, АнализироватьПоДате = Истина)
	
	Результат = Ложь;
	
	Для Каждого СтрокаВакцинации Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл		
		Если СтрокаВакцинации.Вакцинация = Вакцинация Тогда
			
			Результат = Истина;
			
			Для Каждого СтрокаЭтап Из СтрокаВакцинации.ПолучитьЭлементы() Цикл
				
				ЭтапПросрочен = АнализироватьПоДате И (СтрокаЭтап.ДатаОкончанияЭтапа < НачалоДня(ТекущаяДата()))
								Или Не АнализироватьПоДате И (СтрокаЭтап.Состояние = "Просрочена" Или СтрокаЭтап.Состояние = "Отменена");
				
				Если Не ЭтапПросрочен Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РазвернутьСтрокиВакцинацийДерева()
	Для Каждого СтрокаВакцинации Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки = СтрокаВакцинации.ПолучитьИдентификатор();
		Если Не Элементы.НазначенныеВакцинации.Развернут(ИдентификаторСтроки) Тогда
			Элементы.НазначенныеВакцинации.Развернуть(ИдентификаторСтроки);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВакцинациюКлиента(Клиент, Вакцинация)
	ПараметрыОтбора = Новый Структура("Клиент, Вакцинация",Клиент.Ссылка,Вакцинация.Ссылка);
	Набор = РегистрыСведений.ВакцинацияПациентов.СоздатьНаборЗаписей();
	Набор.Отбор.Клиент.Установить(Клиент.Ссылка);
	Набор.Отбор.Вакцинация.Установить(Вакцинация.Ссылка);
	Набор.Прочитать();
	Для Каждого ЗаписьЭтапа Из Набор Цикл
		Набор.Удалить(ЗаписьЭтапа);	
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры

&НаКлиенте
Функция СообщитьКлиентНеЗаполнен()
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		Возврат Ложь;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указан пациент'"),,"Клиент",);
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеОтмененныхЗавершенных(ПеречитатьИзБазы = Ложь)
	
	Если ПеречитатьИзБазы Тогда
		ЗагрузитьВакцинацииКлиента();
	КонецЕсли;
	РазвернутьСтрокиВакцинацийДерева();
	
	ИдентификаторСтроки = Неопределено;
	Отмененная = Ложь;
	Завершенная = Ложь;
	СписокНаУдаление = Новый Массив();
	Для Каждого СтрокаВакцинации Из НазначенныеВакцинации.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки = СтрокаВакцинации.ПолучитьИдентификатор();
		Отмененная = Истина;
		Завершенная = Истина;
		СтрокиЭтапов = СтрокаВакцинации.ПолучитьЭлементы();
		Сч = 0;
		Для Каждого СтрокаЭтапа Из СтрокиЭтапов Цикл
			Сч = Сч + 1;
			Если СтрокаЭтапа.Состояние <> "Отменена" Тогда
				Отмененная = Ложь;	
			КонецЕсли; 
			Если СтрокаЭтапа.Состояние <> "Выполнена" И СтрокаЭтапа.Состояние <> "Отменена" Тогда 
				Завершенная = Ложь;	
			КонецЕсли;
		КонецЦикла; 
		Если Отмененная Тогда
			Если ОтображениеОтмененных = "Отображать" Тогда
				Элементы.НазначенныеВакцинации.Развернуть(ИдентификаторСтроки);	
			ИначеЕсли ОтображениеОтмененных = "Сворачивать" Тогда 
				Элементы.НазначенныеВакцинации.Свернуть(ИдентификаторСтроки);
			ИначеЕсли ОтображениеОтмененных = "Не отображать" Тогда
				СписокНаУдаление.Добавить(СтрокаВакцинации);
			КонецЕсли; 
		ИначеЕсли Завершенная Тогда
			Если ОтображениеЗавершенных = "Отображать" Тогда
				Если Не Элементы.НазначенныеВакцинации.Развернут(ИдентификаторСтроки) Тогда
					Элементы.НазначенныеВакцинации.Развернуть(ИдентификаторСтроки);
				КонецЕсли;
			ИначеЕсли ОтображениеЗавершенных = "Сворачивать" Тогда 
				Если Элементы.НазначенныеВакцинации.Развернут(ИдентификаторСтроки) Тогда
					Элементы.НазначенныеВакцинации.Свернуть(ИдентификаторСтроки);
				КонецЕсли;
			ИначеЕсли ОтображениеЗавершенных = "Не отображать" Тогда
				СписокНаУдаление.Добавить(СтрокаВакцинации);
			КонецЕсли;
		Иначе
			Если Не Элементы.НазначенныеВакцинации.Развернут(ИдентификаторСтроки) Тогда
				Элементы.НазначенныеВакцинации.Развернуть(ИдентификаторСтроки);
			КонецЕсли;				
		КонецЕсли; 
	КонецЦикла;
	Для Каждого СтрокаВакцинации Из СписокНаУдаление Цикл
		НазначенныеВакцинации.ПолучитьЭлементы().Удалить(СтрокаВакцинации);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзмененияВакцинацийВФорме(ОбновитьОтображениеГрупп = Ложь)
	
	ОбновитьСостоянияЭтапов();
	ЗаписатьДанныеВакцинации(НазначенныеВакцинации, Клиент);
	
	Если ОбновитьОтображениеГрупп Тогда
		ОбновитьОтображениеОтмененныхЗавершенных();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
